cylinder_inertial/cylinder_uniformBC/0.org/include/fixedInlet
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

inlet //tableFile;
{
//	type uniformFixedValue;
//	uniformValue tableFile;
//        tableFileCoeffs
//        {
//            //dimensions          [0 0 1 0 0]; // optional dimensions
//           // type
//	    fileName		 "/home/jujja/OpenFOAM/root-2.3.x/run/cylinder/cylinder_Re250/0.org/include/data/dataFile"; // name of data file
//            outOfBounds         repeat;       // optional out-of-bounds handling
//            interpolationScheme linear;      // optional interpolation method
//        }
    type  fixedValue;
    value $internalField;
}

// ************************************************************************* //
