cylinder_inertial/cylinder_uniformBC/0.org/include/frontBackTopBottomPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

top		//AndBottom
{
	type zeroGradient; // type slip;
}

bottom
{
	type zeroGradient; //  type slip;
}

front
{
   	type empty;
}

back
{
    	type empty;
}

// ************************************************************************* //
